{
  "slug": "letter-from-illuminai",
  "title": "💌 Letter From illuminAI",
  "author": "illuminAI Executive Team",
  "image_credit": "Photo by Danny Choi",
  "date": "November 21, 2025",
  "excerpt": "A brief introduction to illuminAI, on why we believe AI is about people, not just tech, and how our initiatives invite everyone to join the conversation on AI ethics.",
  "content": "Hi Lumens,\n\nWelcome to the new blog initiative at IlluminAI. Our mission starts from a single belief: artificial intelligence (AI) is about people and is for everyone. \n\nAs advances in AI accelerate and become woven into our daily lives, we believe it’s crucial to amplify diverse perspectives and bring together many voices to shape the future we’ll be living in together. This blog is one of the ways we’ll do that: a place to share ideas, questions, concerns, and creativity around AI.\n\nIt’s easy to think of AI as something abstract or \"too technical\", something that belongs only to engineers, labs, or tech companies. In universities and even in society more broadly, disciplines often become isolated from one another, especially when it comes to technology. But AI doesn’t exist on its own. It intersects with ethics, law, medicine, education, art, and our everyday choices. We recognize this separation can make people alienated, overwhelmed or even scared by the idea of “artificial” intelligence. That’s why we want to bridge this gap and normalize interdisciplinary conversations about AI.\n\nWe believe every voice brings something insightful. Whether you see yourself as a writer, thinker, designer, engineer, researcher, or even just someone curious, you have something valuable to contribute here. With creativity and critical thinking at the core of our work, we welcome any skill, talent or perspective.\n\n This year, we’re excited to grow our work through video interviews with experts in the field, a growing collection of articles from our writers, magazines that centralizes the articles and graphic designs, and our flagship AI Ethics Conference, reimagined and expanded from our original hackathon format.\n\nAcross all of these initiatives, our goal is the same: to invite more people into the conversation about AI, to raise important questions, and to learn and grow together.\n\n Our doors are always open. If you’d like to join, contribute, or simply learn more, we’d love to have you with us. No experience is too little, and no interest is too small. \n\nWelcome to our community!\n\nCheers,\n\nilluminAI executive team",
  "image": "/images/blogs/letter-from-illuminai.png"
}
